{
  "_class_name": "DPMSolverMultistepScheduler",
  "_diffusers_version": "0.32.2",
  "_name_or_path": "runwayml/stable-diffusion-v1-5",
  "algorithm_type": "dpmsolver++",
  "beta_end": 0.02,
  "beta_schedule": "linear",
  "beta_start": 0.0001,
  "dynamic_thresholding_ratio": 0.995,
  "euler_at_final": false,
  "feature_extractor": [
    "transformers",
    "CLIPImageProcessor"
  ],
  "final_sigmas_type": "zero",
  "flow_shift": 1.0,
  "image_encoder": [
    null,
    null
  ],
  "lambda_min_clipped": -Infinity,
  "lower_order_final": true,
  "num_train_timesteps": 1000,
  "prediction_type": "epsilon",
  "requires_safety_checker": true,
  "rescale_betas_zero_snr": false,
  "safety_checker": [
    "stable_diffusion",
    "StableDiffusionSafetyChecker"
  ],
  "sample_max_value": 1.0,
  "scheduler": [
    "diffusers",
    "PNDMScheduler"
  ],
  "solver_order": 2,
  "solver_type": "midpoint",
  "steps_offset": 0,
  "text_encoder": [
    "transformers",
    "CLIPTextModel"
  ],
  "thresholding": false,
  "timestep_spacing": "linspace",
  "tokenizer": [
    "transformers",
    "CLIPTokenizer"
  ],
  "trained_betas": null,
  "unet": [
    "diffusers",
    "UNet2DConditionModel"
  ],
  "use_beta_sigmas": false,
  "use_exponential_sigmas": false,
  "use_flow_sigmas": false,
  "use_karras_sigmas": false,
  "use_lu_lambdas": false,
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ],
  "variance_type": null
}
