{
  "architectures": [
    "StableDiffusionSafetyChecker"
  ],
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "clip",
  "projection_dim": 768,
  "text_config": {
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "hidden_act": "quick_gelu",
    "hidden_size": 768,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 77,
    "model_type": "clip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "projection_dim": 512,
    "torch_dtype": "float32",
    "vocab_size": 49408
  },
  "torch_dtype": "float32",
<<<<<<< HEAD:models/stable-diffusion-v1-5/safety_checker/config.json
  "transformers_version": "4.52.3",
  "vision_config": {
=======
  "transformers_version": "4.50.0",
  "vision_config": {
    "_attn_implementation_autoset": true,
>>>>>>> 9411348c1922015a8bbedfa7d968a6a87605051c:Tasks/models/stable-diffusion-v1-5/safety_checker/config.json
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "hidden_act": "quick_gelu",
    "hidden_size": 1024,
    "image_size": 224,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "layer_norm_eps": 1e-05,
    "model_type": "clip_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "projection_dim": 512,
    "torch_dtype": "float32"
  }
}
